12/data/attachments/c2ff1343d5366a25.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_19249d94-f068-4de5-aefb-eeb0eb80a5e8</nif:username>
            <nif:friendToBeAdded>Alyssa_until_Friend_4726_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>